# IFC_DMIsPSetFldOpt

## Description
Checks if specified Field for IfcEntry's PSet is Optional.

```pascal
FUNCTION IFC_DMIsPSetFldOpt(
				strObjectName : STRING;
				strEntryName  : STRING;
				strPSetName   : STRING;
				strFieldName  : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMIsPSetFldOpt(strObjectName, strEntryName, strPSetName, strFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING||
|strEntryName|STRING||
|strPSetName|STRING||
|strFieldName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* IFC